Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # cloudflare_ruleset.zone_custom_firewall will be created
+ resource "cloudflare_ruleset" "zone_custom_firewall" {
      + id      = (known after apply)
      + kind    = "zone"
      + name    = "Phase entry point ruleset for custom rules in my zone"
      + phase   = "http_request_firewall_custom"
      + zone_id = "25162860ed4fdb290f7c9943b1b0a030"

      + rules {
          + action       = "block"
          + description  = "Only Malaysia!"
          + enabled      = true
          + expression   = "(ip.geoip.country ne \"MY\" and http.host eq \"test.rosprivatetutor.my\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mlhein%252Ftest-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`